问题描述
　　某寝室的同学们在学术完之后准备玩一个游戏：游戏是这样的，每个人头上都被贴了一张白色或者黑色的纸，现在每个人都会说一句话“我看到x张白色纸条和y张黑色的纸条”，又已知每个头上贴着白色纸的人说的是真话、每个头上贴着黑色纸的人说的是谎话，现在要求你判断哪些人头上贴着的是白色的纸条，如果无解输出“NoSolution.”；如果有多组解，则把每个答案中贴白条的人的编号按照大小排列后组成一个数（比如第一个人和第三个人头上贴着的是白纸条，那么这个数就是13；如果第6、7、8个人都贴的是白纸条，那么这个数就是678）输出最小的那个数（如果全部都是黑纸条也满足情况的话，那么输出0）
输入格式
　　第一行为一个整数n，接下来n行中的第i行有两个整数x和y，分别表示第i个人说“我看到x张白色纸条和y张黑色的纸条”。
输出格式
　　一行。如果无解输出“NoSolution.”。否则输出答案中数值（具体见问题描述）最小的那个，如果全部都是黑纸条也满足情况的话，那么输出0
样例输入
2
1 0
1 0
样例输出
0
样例输入
5
3 1
0 4
1 3
4 0
1 3
样例输出
35
数据规模和约定
　　n<=8

----------------------------------------------
#include<bits/stdc++.h>
using namespace std;
int main () {
	int n;
	scanf("%d", &n);
	vector<vector<int> > a;
	a.resize(n, vector<int>(2));
	for (int i = 0; i < n; i++) {
		scanf("%d %d", &a[i][1], &a[i][0]); // a[i][1]:白； a[i][0]:黑 
	}
	for (int i = 0; i < (1 << n); i++) {
		vector<int> tr(n);
		for (int j = 0; j < n; j++) {
			tr[j] = (i >> j & 1);// 1 - 白；0 - 黑 
		}
		int flag = 1;
		for (int j = 0; j < n && flag; j++) {
			int cnt = 0;
			for (int k = 0; k < n; k++) {
				if (k == j) {
					continue;
				}
				if (tr[k] == 1) {
					cnt++;
				}
			} 
			if ((tr[j] == 1 && cnt != a[j][1]) || (tr[j] == 0 && cnt == a[j][1])) {
				flag = 0;
			} 
		}
		if (flag) {
			int ans = 0;
			for (int j = 0; j < n; j++) {
				if (tr[j] == 1) {
					ans = ans * 10 + j + 1;
				}
			}
			printf("%d\n", ans);
			return 0;
		}
	} 
	printf("NoSolution.\n");
	return 0;
}

------------------------------------------
二进制枚举
