问题描述
　　有n个人正在饭堂排队买海北鸡饭。每份海北鸡饭要25元。奇怪的是，每个人手里只有一张钞票（每张钞票的面值为25、50、100元），而且饭堂阿姨一开始没有任何零钱。请问饭堂阿姨能否给所有人找零（假设饭堂阿姨足够聪明）
输入格式
　　第一行一个整数n，表示排队的人数。

　　接下来n个整数a[1],a[2],...,a[n]。a[i]表示第i位学生手里钞票的价值（i越小，在队伍里越靠前）
输出格式
　　输出YES或者NO
样例输入
4
25 25 50 50
样例输出
YES
样例输入
2
25 100
样例输出
NO
样例输入
4
25 25 50 100
样例输出
YES
数据规模和约定
　　n不超过1000000

------------------------------------------------
#include<bits/stdc++.h>
using namespace std;
int main () {
	int n, a[4] = {0}, t;
	scanf("%d", &n);
	for (int i = 0; i < n; i++) {
		scanf("%d", &t);
		if (t == 25) {
			a[1]++;
		} else if (t == 50) {
			if (a[1] == 0) {
				printf("NO");
				return 0;
			} else {
				a[1]--;
				a[2]++;
			}
		} else if (t == 100) {
			if (a[2] != 0 && a[1] != 0) {
				a[3]++;
				a[1]--;
				a[2]--;
			} else if (a[1] >= 3) {
				a[3]++;
				a[1] -= 3;
			} else {
				printf("NO");
				return 0;
			}
		}
	}
	printf("YES");
	return 0;
}
